zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp251fxx_cm0.h
/******************  Bit definition for EXTI1_SWIER1 register  ******************/
#define EXTI1_SWIER1_SWI0_Pos     (0U)
#define EXTI1_SWIER1_SWI0_Msk     (0x1UL << EXTI1_SWIER1_SWI0_Pos)            /*!< 0x00000001 */
#define EXTI1_SWIER1_SWI0         EXTI1_SWIER1_SWI0_Msk                      /*!< Software Interrupt on line 0 */
#define EXTI1_SWIER1_SWI1_Pos     (1U)
#define EXTI1_SWIER1_SWI1_Msk     (0x1UL << EXTI1_SWIER1_SWI1_Pos)            /*!< 0x00000002 */
#define EXTI1_SWIER1_SWI1         EXTI1_SWIER1_SWI1_Msk                      /*!< Software Interrupt on line 1 */
#define EXTI1_SWIER1_SWI2_Pos     (2U)
#define EXTI1_SWIER1_SWI2_Msk     (0x1UL << EXTI1_SWIER1_SWI2_Pos)            /*!< 0x00000004 */
#define EXTI1_SWIER1_SWI2         EXTI1_SWIER1_SWI2_Msk                      /*!< Software Interrupt on line 2 */
#define EXTI1_SWIER1_SWI3_Pos     (3U)
#define EXTI1_SWIER1_SWI3_Msk     (0x1UL << EXTI1_SWIER1_SWI3_Pos)            /*!< 0x00000008 */
#define EXTI1_SWIER1_SWI3         EXTI1_SWIER1_SWI3_Msk                      /*!< Software Interrupt on line 3 */
#define EXTI1_SWIER1_SWI4_Pos     (4U)
#define EXTI1_SWIER1_SWI4_Msk     (0x1UL << EXTI1_SWIER1_SWI4_Pos)            /*!< 0x00000010 */
#define EXTI1_SWIER1_SWI4         EXTI1_SWIER1_SWI4_Msk                      /*!< Software Interrupt on line 4 */
#define EXTI1_SWIER1_SWI5_Pos     (5U)
#define EXTI1_SWIER1_SWI5_Msk     (0x1UL << EXTI1_SWIER1_SWI5_Pos)            /*!< 0x00000020 */
#define EXTI1_SWIER1_SWI5         EXTI1_SWIER1_SWI5_Msk                      /*!< Software Interrupt on line 5 */
#define EXTI1_SWIER1_SWI6_Pos     (6U)
#define EXTI1_SWIER1_SWI6_Msk     (0x1UL << EXTI1_SWIER1_SWI6_Pos)            /*!< 0x00000040 */
#define EXTI1_SWIER1_SWI6         EXTI1_SWIER1_SWI6_Msk                      /*!< Software Interrupt on line 6 */
#define EXTI1_SWIER1_SWI7_Pos     (7U)
#define EXTI1_SWIER1_SWI7_Msk     (0x1UL << EXTI1_SWIER1_SWI7_Pos)            /*!< 0x00000080 */
#define EXTI1_SWIER1_SWI7         EXTI1_SWIER1_SWI7_Msk                      /*!< Software Interrupt on line 7 */
#define EXTI1_SWIER1_SWI8_Pos     (8U)
#define EXTI1_SWIER1_SWI8_Msk     (0x1UL << EXTI1_SWIER1_SWI8_Pos)            /*!< 0x00000100 */
#define EXTI1_SWIER1_SWI8         EXTI1_SWIER1_SWI8_Msk                      /*!< Software Interrupt on line 8 */
#define EXTI1_SWIER1_SWI9_Pos     (9U)
#define EXTI1_SWIER1_SWI9_Msk     (0x1UL << EXTI1_SWIER1_SWI9_Pos)            /*!< 0x00000200 */
#define EXTI1_SWIER1_SWI9         EXTI1_SWIER1_SWI9_Msk                      /*!< Software Interrupt on line 9 */
#define EXTI1_SWIER1_SWI10_Pos    (10U)
#define EXTI1_SWIER1_SWI10_Msk    (0x1UL << EXTI1_SWIER1_SWI10_Pos)           /*!< 0x00000400 */
#define EXTI1_SWIER1_SWI10        EXTI1_SWIER1_SWI10_Msk                     /*!< Software Interrupt on line 10 */
#define EXTI1_SWIER1_SWI11_Pos    (11U)
#define EXTI1_SWIER1_SWI11_Msk    (0x1UL << EXTI1_SWIER1_SWI11_Pos)           /*!< 0x00000800 */
#define EXTI1_SWIER1_SWI11        EXTI1_SWIER1_SWI11_Msk                     /*!< Software Interrupt on line 11 */
#define EXTI1_SWIER1_SWI12_Pos    (12U)
#define EXTI1_SWIER1_SWI12_Msk    (0x1UL << EXTI1_SWIER1_SWI12_Pos)           /*!< 0x00001000 */
#define EXTI1_SWIER1_SWI12        EXTI1_SWIER1_SWI12_Msk                     /*!< Software Interrupt on line 12 */
#define EXTI1_SWIER1_SWI13_Pos    (13U)
#define EXTI1_SWIER1_SWI13_Msk    (0x1UL << EXTI1_SWIER1_SWI13_Pos)           /*!< 0x00002000 */
#define EXTI1_SWIER1_SWI13        EXTI1_SWIER1_SWI13_Msk                     /*!< Software Interrupt on line 13 */
#define EXTI1_SWIER1_SWI14_Pos    (14U)
#define EXTI1_SWIER1_SWI14_Msk    (0x1UL << EXTI1_SWIER1_SWI14_Pos)           /*!< 0x00004000 */
#define EXTI1_SWIER1_SWI14        EXTI1_SWIER1_SWI14_Msk                     /*!< Software Interrupt on line 14 */
#define EXTI1_SWIER1_SWI15_Pos    (15U)
#define EXTI1_SWIER1_SWI15_Msk    (0x1UL << EXTI1_SWIER1_SWI15_Pos)           /*!< 0x00008000 */
#define EXTI1_SWIER1_SWI15        EXTI1_SWIER1_SWI15_Msk                     /*!< Software Interrupt on line 15 */
#define EXTI1_SWIER1_SWI16_Pos    (16U)
#define EXTI1_SWIER1_SWI16_Msk    (0x1UL << EXTI1_SWIER1_SWI16_Pos)           /*!< 0x00010000 */
#define EXTI1_SWIER1_SWI16        EXTI1_SWIER1_SWI16_Msk                     /*!< Software Interrupt on line 16 */
#define EXTI1_SWIER1_SWI17_Pos    (17U)
#define EXTI1_SWIER1_SWI17_Msk    (0x1UL << EXTI1_SWIER1_SWI17_Pos)           /*!< 0x00020000 */
#define EXTI1_SWIER1_SWI17        EXTI1_SWIER1_SWI17_Msk                     /*!< Software Interrupt on line 17 */
#define EXTI1_SWIER1_SWI18_Pos    (18U)
#define EXTI1_SWIER1_SWI18_Msk    (0x1UL << EXTI1_SWIER1_SWI18_Pos)           /*!< 0x00040000 */
#define EXTI1_SWIER1_SWI18        EXTI1_SWIER1_SWI18_Msk                     /*!< Software Interrupt on line 18 */

/******************  Bit definition for EXTI1_RPR1 register  *******************/
#define EXTI1_RPR1_RPIF0_Pos         (0U)
#define EXTI1_RPR1_RPIF0_Msk         (0x1UL << EXTI1_RPR1_RPIF0_Pos)                /*!< 0x00000001 */
#define EXTI1_RPR1_RPIF0             EXTI1_RPR1_RPIF0_Msk                          /*!< Rising trigger event configuration bit of line 0 */
#define EXTI1_RPR1_RPIF1_Pos         (1U)
#define EXTI1_RPR1_RPIF1_Msk         (0x1UL << EXTI1_RPR1_RPIF1_Pos)                /*!< 0x00000002 */
#define EXTI1_RPR1_RPIF1             EXTI1_RPR1_RPIF1_Msk                          /*!< Rising trigger event configuration bit of line 1 */
#define EXTI1_RPR1_RPIF2_Pos         (2U)
#define EXTI1_RPR1_RPIF2_Msk         (0x1UL << EXTI1_RPR1_RPIF2_Pos)                /*!< 0x00000004 */
#define EXTI1_RPR1_RPIF2             EXTI1_RPR1_RPIF2_Msk                          /*!< Rising trigger event configuration bit of line 2 */
#define EXTI1_RPR1_RPIF3_Pos         (3U)
#define EXTI1_RPR1_RPIF3_Msk         (0x1UL << EXTI1_RPR1_RPIF3_Pos)                /*!< 0x00000008 */
#define EXTI1_RPR1_RPIF3             EXTI1_RPR1_RPIF3_Msk                          /*!< Rising trigger event configuration bit of line 3 */
#define EXTI1_RPR1_RPIF4_Pos         (4U)
#define EXTI1_RPR1_RPIF4_Msk         (0x1UL << EXTI1_RPR1_RPIF4_Pos)                /*!< 0x00000010 */
#define EXTI1_RPR1_RPIF4             EXTI1_RPR1_RPIF4_Msk                          /*!< Rising trigger event configuration bit of line 4 */
#define EXTI1_RPR1_RPIF5_Pos         (5U)
#define EXTI1_RPR1_RPIF5_Msk         (0x1UL << EXTI1_RPR1_RPIF5_Pos)                /*!< 0x00000020 */
#define EXTI1_RPR1_RPIF5             EXTI1_RPR1_RPIF5_Msk                          /*!< Rising trigger event configuration bit of line 5 */
#define EXTI1_RPR1_RPIF6_Pos         (6U)
#define EXTI1_RPR1_RPIF6_Msk         (0x1UL << EXTI1_RPR1_RPIF6_Pos)                /*!< 0x00000040 */
#define EXTI1_RPR1_RPIF6             EXTI1_RPR1_RPIF6_Msk                          /*!< Rising trigger event configuration bit of line 6 */
#define EXTI1_RPR1_RPIF7_Pos         (7U)
#define EXTI1_RPR1_RPIF7_Msk         (0x1UL << EXTI1_RPR1_RPIF7_Pos)                /*!< 0x00000080 */
#define EXTI1_RPR1_RPIF7             EXTI1_RPR1_RPIF7_Msk                          /*!< Rising trigger event configuration bit of line 7 */
#define EXTI1_RPR1_RPIF8_Pos         (8U)
#define EXTI1_RPR1_RPIF8_Msk         (0x1UL << EXTI1_RPR1_RPIF8_Pos)                /*!< 0x00000100 */
#define EXTI1_RPR1_RPIF8             EXTI1_RPR1_RPIF8_Msk                          /*!< Rising trigger event configuration bit of line 8 */
#define EXTI1_RPR1_RPIF9_Pos         (9U)
#define EXTI1_RPR1_RPIF9_Msk         (0x1UL << EXTI1_RPR1_RPIF9_Pos)                /*!< 0x00000200 */
#define EXTI1_RPR1_RPIF9             EXTI1_RPR1_RPIF9_Msk                          /*!< Rising trigger event configuration bit of line 9 */
#define EXTI1_RPR1_RPIF10_Pos        (10U)
#define EXTI1_RPR1_RPIF10_Msk        (0x1UL << EXTI1_RPR1_RPIF10_Pos)               /*!< 0x00000400 */
#define EXTI1_RPR1_RPIF10            EXTI1_RPR1_RPIF10_Msk                         /*!< Rising trigger event configuration bit of line 10 */
#define EXTI1_RPR1_RPIF11_Pos        (11U)
#define EXTI1_RPR1_RPIF11_Msk        (0x1UL << EXTI1_RPR1_RPIF11_Pos)               /*!< 0x00000800 */
#define EXTI1_RPR1_RPIF11            EXTI1_RPR1_RPIF11_Msk                         /*!< Rising trigger event configuration bit of line 11 */
#define EXTI1_RPR1_RPIF12_Pos        (12U)
#define EXTI1_RPR1_RPIF12_Msk        (0x1UL << EXTI1_RPR1_RPIF12_Pos)               /*!< 0x00001000 */
#define EXTI1_RPR1_RPIF12            EXTI1_RPR1_RPIF12_Msk                         /*!< Rising trigger event configuration bit of line 12 */
#define EXTI1_RPR1_RPIF13_Pos        (13U)
#define EXTI1_RPR1_RPIF13_Msk        (0x1UL << EXTI1_RPR1_RPIF13_Pos)               /*!< 0x00002000 */
#define EXTI1_RPR1_RPIF13            EXTI1_RPR1_RPIF13_Msk                         /*!< Rising trigger event configuration bit of line 13 */
#define EXTI1_RPR1_RPIF14_Pos        (14U)
#define EXTI1_RPR1_RPIF14_Msk        (0x1UL << EXTI1_RPR1_RPIF14_Pos)               /*!< 0x00004000 */
#define EXTI1_RPR1_RPIF14            EXTI1_RPR1_RPIF14_Msk                         /*!< Rising trigger event configuration bit of line 14 */
#define EXTI1_RPR1_RPIF15_Pos        (15U)
#define EXTI1_RPR1_RPIF15_Msk        (0x1UL << EXTI1_RPR1_RPIF15_Pos)               /*!< 0x00008000 */
#define EXTI1_RPR1_RPIF15            EXTI1_RPR1_RPIF15_Msk                         /*!< Rising trigger event configuration bit of line 15 */
#define EXTI1_RPR1_RPIF16_Pos        (16U)
#define EXTI1_RPR1_RPIF16_Msk        (0x1UL << EXTI1_RPR1_RPIF16_Pos)               /*!< 0x00010000 */
#define EXTI1_RPR1_RPIF16            EXTI1_RPR1_RPIF16_Msk                         /*!< Rising trigger event configuration bit of line 16 */
#define EXTI1_RPR1_RPIF17_Pos        (17U)
#define EXTI1_RPR1_RPIF17_Msk        (0x1UL << EXTI1_RPR1_RPIF17_Pos)               /*!< 0x00020000 */
#define EXTI1_RPR1_RPIF17            EXTI1_RPR1_RPIF17_Msk                         /*!< Rising trigger event configuration bit of line 17 */
#define EXTI1_RPR1_RPIF18_Pos        (18U)
#define EXTI1_RPR1_RPIF18_Msk        (0x1UL << EXTI1_RPR1_RPIF18_Pos)               /*!< 0x00040000 */
#define EXTI1_RPR1_RPIF18            EXTI1_RPR1_RPIF18_Msk                         /*!< Rising trigger event configuration bit of line 18 */

