zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp251fxx_cm0.h
/******************  Bit definition for EXTI1_FTSR3 register  *******************/
#define EXTI1_FTSR3_FT64_Pos        (0U)
#define EXTI1_FTSR3_FT64_Msk        (0x1UL << EXTI1_FTSR3_FT64_Pos)               /*!< 0x00000001 */
#define EXTI1_FTSR3_FT64            EXTI1_FTSR3_FT64_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_FTSR3_FT65_Pos        (1U)
#define EXTI1_FTSR3_FT65_Msk        (0x1UL << EXTI1_FTSR3_FT65_Pos)               /*!< 0x00000002 */
#define EXTI1_FTSR3_FT65            EXTI1_FTSR3_FT65_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI1_FTSR3_FT67_Pos        (3U)
#define EXTI1_FTSR3_FT67_Msk        (0x1UL << EXTI1_FTSR3_FT67_Pos)               /*!< 0x00000008 */
#define EXTI1_FTSR3_FT67            EXTI1_FTSR3_FT67_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_FTSR3_FT73_Pos        (9U)
#define EXTI1_FTSR3_FT73_Msk        (0x1UL << EXTI1_FTSR3_FT73_Pos)               /*!< 0x00400000 */
#define EXTI1_FTSR3_FT73            EXTI1_FTSR3_FT73_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI1_FTSR3_FT83_Pos        (19U)
#define EXTI1_FTSR3_FT83_Msk        (0x1UL << EXTI1_FTSR3_FT83_Pos)               /*!< 0x00080000 */
#define EXTI1_FTSR3_FT83            EXTI1_FTSR3_FT83_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_FTSR3_FT84_Pos        (20U)
#define EXTI1_FTSR3_FT84_Msk        (0x1UL << EXTI1_FTSR3_FT84_Pos)               /*!< 0x00100000 */
#define EXTI1_FTSR3_FT84            EXTI1_FTSR3_FT84_Msk                         /*!< Rising trigger event configuration bit of line 86 */

/******************  Bit definition for EXTI1_SWIER3 register  ******************/
#define EXTI1_SWIER3_SWI64_Pos    (0U)
#define EXTI1_SWIER3_SWI64_Msk    (0x1UL << EXTI1_SWIER3_SWI64_Pos)           /*!< 0x00000001 */
#define EXTI1_SWIER3_SWI64        EXTI1_SWIER3_SWI64_Msk                     /*!< Software Interrupt on line 85 */
#define EXTI1_SWIER3_SWI65_Pos    (1U)
#define EXTI1_SWIER3_SWI65_Msk    (0x1UL << EXTI1_SWIER3_SWI65_Pos)           /*!< 0x00000002 */
#define EXTI1_SWIER3_SWI65        EXTI1_SWIER3_SWI65_Msk                     /*!< Software Interrupt on line 86 */
#define EXTI1_SWIER3_SWI67_Pos    (3U)
#define EXTI1_SWIER3_SWI67_Msk    (0x1UL << EXTI1_SWIER3_SWI67_Pos)           /*!< 0x00000008 */
#define EXTI1_SWIER3_SWI67        EXTI1_SWIER3_SWI67_Msk                     /*!< Software Interrupt on line 85 */
#define EXTI1_SWIER3_SWI73_Pos    (9U)
#define EXTI1_SWIER3_SWI73_Msk    (0x1UL << EXTI1_SWIER3_SWI73_Pos)           /*!< 0x00000200 */
#define EXTI1_SWIER3_SWI73        EXTI1_SWIER3_SWI73_Msk                     /*!< Software Interrupt on line 86 */
#define EXTI1_SWIER3_SWI83_Pos    (19U)
#define EXTI1_SWIER3_SWI83_Msk    (0x1UL << EXTI1_SWIER3_SWI83_Pos)           /*!< 0x00200000 */
#define EXTI1_SWIER3_SWI83        EXTI1_SWIER3_SWI83_Msk                     /*!< Software Interrupt on line 85 */
#define EXTI1_SWIER3_SWI84_Pos    (20U)
#define EXTI1_SWIER3_SWI84_Msk    (0x1UL << EXTI1_SWIER3_SWI84_Pos)           /*!< 0x00400000 */
#define EXTI1_SWIER3_SWI84        EXTI1_SWIER3_SWI84_Msk                     /*!< Software Interrupt on line 86 */

/******************  Bit definition for EXTI1_RPR3 register  *******************/
#define EXTI1_RPR3_RPIF64_Pos        (0U)
#define EXTI1_RPR3_RPIF64_Msk        (0x1UL << EXTI1_RPR3_RPIF64_Pos)               /*!< 0x00000001 */
#define EXTI1_RPR3_RPIF64            EXTI1_RPR3_RPIF64_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_RPR3_RPIF65_Pos        (1U)
#define EXTI1_RPR3_RPIF65_Msk        (0x1UL << EXTI1_RPR3_RPIF65_Pos)               /*!< 0x00000002 */
#define EXTI1_RPR3_RPIF65            EXTI1_RPR3_RPIF65_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI1_RPR3_RPIF67_Pos        (3U)
#define EXTI1_RPR3_RPIF67_Msk        (0x1UL << EXTI1_RPR3_RPIF67_Pos)               /*!< 0x00000008 */
#define EXTI1_RPR3_RPIF67            EXTI1_RPR3_RPIF67_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_RPR3_RPIF73_Pos        (9U)
#define EXTI1_RPR3_RPIF73_Msk        (0x1UL << EXTI1_RPR3_RPIF73_Pos)               /*!< 0x00400000 */
#define EXTI1_RPR3_RPIF73            EXTI1_RPR3_RPIF73_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI1_RPR3_RPIF83_Pos        (19U)
#define EXTI1_RPR3_RPIF83_Msk        (0x1UL << EXTI1_RPR3_RPIF83_Pos)               /*!< 0x00080000 */
#define EXTI1_RPR3_RPIF83            EXTI1_RPR3_RPIF83_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_RPR3_RPIF84_Pos        (20U)
#define EXTI1_RPR3_RPIF84_Msk        (0x1UL << EXTI1_RPR3_RPIF84_Pos)               /*!< 0x00100000 */
#define EXTI1_RPR3_RPIF84            EXTI1_RPR3_RPIF84_Msk                         /*!< Rising trigger event configuration bit of line 86 */

/******************  Bit definition for EXTI1_FPR3 register  *******************/
#define EXTI1_FPR3_FPIF64_Pos        (0U)
#define EXTI1_FPR3_FPIF64_Msk        (0x1UL << EXTI1_FPR3_FPIF64_Pos)               /*!< 0x00000001 */
#define EXTI1_FPR3_FPIF64            EXTI1_FPR3_FPIF64_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_FPR3_FPIF65_Pos        (1U)
#define EXTI1_FPR3_FPIF65_Msk        (0x1UL << EXTI1_FPR3_FPIF65_Pos)               /*!< 0x00000002 */
#define EXTI1_FPR3_FPIF65            EXTI1_FPR3_FPIF65_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI1_FPR3_FPIF67_Pos        (3U)
#define EXTI1_FPR3_FPIF67_Msk        (0x1UL << EXTI1_FPR3_FPIF67_Pos)               /*!< 0x00000008 */
#define EXTI1_FPR3_FPIF67            EXTI1_FPR3_FPIF67_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_FPR3_FPIF73_Pos        (9U)
#define EXTI1_FPR3_FPIF73_Msk        (0x1UL << EXTI1_FPR3_FPIF73_Pos)               /*!< 0x00400000 */
#define EXTI1_FPR3_FPIF73            EXTI1_FPR3_FPIF73_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI1_FPR3_FPIF83_Pos        (19U)
#define EXTI1_FPR3_FPIF83_Msk        (0x1UL << EXTI1_FPR3_FPIF83_Pos)               /*!< 0x00080000 */
#define EXTI1_FPR3_FPIF83            EXTI1_FPR3_FPIF83_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_FPR3_FPIF84_Pos        (20U)
#define EXTI1_FPR3_FPIF84_Msk        (0x1UL << EXTI1_FPR3_FPIF84_Pos)               /*!< 0x00100000 */
#define EXTI1_FPR3_FPIF84            EXTI1_FPR3_FPIF84_Msk                         /*!< Rising trigger event configuration bit of line 86 */

/******************  Bit definition for EXTI1_SECCFGR3  register  ******************/
#define EXTI1_SECCFGR3_SEC64_Pos  (0U)
#define EXTI1_SECCFGR3_SEC64_Msk  (0x1UL << EXTI1_SECCFGR3_SEC64_Pos)          /*!< 0x00000001 */
#define EXTI1_SECCFGR3_SEC64      EXTI1_SECCFGR3_SEC64_Msk                    /*!< SEC/PRIV enable on event input 64 */
#define EXTI1_SECCFGR3_SEC65_Pos  (1U)
#define EXTI1_SECCFGR3_SEC65_Msk  (0x1UL << EXTI1_SECCFGR3_SEC65_Pos)          /*!< 0x00000002 */
#define EXTI1_SECCFGR3_SEC65      EXTI1_SECCFGR3_SEC65_Msk                    /*!< SEC/PRIV enable on event input 65 */
#define EXTI1_SECCFGR3_SEC66_Pos  (2U)
#define EXTI1_SECCFGR3_SEC66_Msk  (0x1UL << EXTI1_SECCFGR3_SEC66_Pos)          /*!< 0x00000004 */
#define EXTI1_SECCFGR3_SEC66      EXTI1_SECCFGR3_SEC66_Msk                    /*!< SEC/PRIV enable on event input 66 */
#define EXTI1_SECCFGR3_SEC67_Pos  (3U)
#define EXTI1_SECCFGR3_SEC67_Msk  (0x1UL << EXTI1_SECCFGR3_SEC67_Pos)          /*!< 0x00000008 */
#define EXTI1_SECCFGR3_SEC67      EXTI1_SECCFGR3_SEC67_Msk                    /*!< SEC/PRIV enable on event input 67 */
#define EXTI1_SECCFGR3_SEC68_Pos  (4U)
#define EXTI1_SECCFGR3_SEC68_Msk  (0x1UL << EXTI1_SECCFGR3_SEC68_Pos)          /*!< 0x00000010 */
#define EXTI1_SECCFGR3_SEC68      EXTI1_SECCFGR3_SEC68_Msk                    /*!< SEC/PRIV enable on event input 68 */
#define EXTI1_SECCFGR3_SEC69_Pos  (5U)
#define EXTI1_SECCFGR3_SEC69_Msk  (0x1UL << EXTI1_SECCFGR3_SEC69_Pos)          /*!< 0x00000020 */
#define EXTI1_SECCFGR3_SEC69      EXTI1_SECCFGR3_SEC69_Msk                    /*!< SEC/PRIV enable on event input 69 */
#define EXTI1_SECCFGR3_SEC70_Pos  (6U)
#define EXTI1_SECCFGR3_SEC70_Msk  (0x1UL << EXTI1_SECCFGR3_SEC70_Pos)          /*!< 0x00000040 */
#define EXTI1_SECCFGR3_SEC70      EXTI1_SECCFGR3_SEC70_Msk                    /*!< SEC/PRIV enable on event input 70 */
#define EXTI1_SECCFGR3_SEC71_Pos  (7U)
#define EXTI1_SECCFGR3_SEC71_Msk  (0x1UL << EXTI1_SECCFGR3_SEC71_Pos)          /*!< 0x00000080 */
#define EXTI1_SECCFGR3_SEC71      EXTI1_SECCFGR3_SEC71_Msk                    /*!< SEC/PRIV enable on event input 71 */
#define EXTI1_SECCFGR3_SEC72_Pos  (8U)
#define EXTI1_SECCFGR3_SEC72_Msk  (0x1UL << EXTI1_SECCFGR3_SEC72_Pos)          /*!< 0x00000100 */
#define EXTI1_SECCFGR3_SEC72      EXTI1_SECCFGR3_SEC72_Msk                    /*!< SEC/PRIV enable on event input 72 */
#define EXTI1_SECCFGR3_SEC73_Pos  (9U)
#define EXTI1_SECCFGR3_SEC73_Msk  (0x1UL << EXTI1_SECCFGR3_SEC73_Pos)          /*!< 0x00000200 */
#define EXTI1_SECCFGR3_SEC73      EXTI1_SECCFGR3_SEC73_Msk                    /*!< SEC/PRIV enable on event input 73 */
#define EXTI1_SECCFGR3_SEC74_Pos  (10U)
#define EXTI1_SECCFGR3_SEC74_Msk  (0x1UL << EXTI1_SECCFGR3_SEC74_Pos)           /*!< 0x00000400 */
#define EXTI1_SECCFGR3_SEC74      EXTI1_SECCFGR3_SEC74_Msk                     /*!< SEC/PRIV enable on event input 74 */
#define EXTI1_SECCFGR3_SEC75_Pos  (11U)
#define EXTI1_SECCFGR3_SEC75_Msk  (0x1UL << EXTI1_SECCFGR3_SEC75_Pos)           /*!< 0x00000800 */
#define EXTI1_SECCFGR3_SEC75      EXTI1_SECCFGR3_SEC75_Msk                     /*!< SEC/PRIV enable on event input 75 */
#define EXTI1_SECCFGR3_SEC76_Pos  (12U)
#define EXTI1_SECCFGR3_SEC76_Msk  (0x1UL << EXTI1_SECCFGR3_SEC76_Pos)           /*!< 0x00001000 */
#define EXTI1_SECCFGR3_SEC76      EXTI1_SECCFGR3_SEC76_Msk                     /*!< SEC/PRIV enable on event input 76 */
#define EXTI1_SECCFGR3_SEC77_Pos  (13U)
#define EXTI1_SECCFGR3_SEC77_Msk  (0x1UL << EXTI1_SECCFGR3_SEC77_Pos)           /*!< 0x00002000 */
#define EXTI1_SECCFGR3_SEC77      EXTI1_SECCFGR3_SEC77_Msk                     /*!< SEC/PRIV enable on event input 77 */
#define EXTI1_SECCFGR3_SEC78_Pos  (14U)
#define EXTI1_SECCFGR3_SEC78_Msk  (0x1UL << EXTI1_SECCFGR3_SEC78_Pos)           /*!< 0x00004000 */
#define EXTI1_SECCFGR3_SEC78      EXTI1_SECCFGR3_SEC78_Msk                     /*!< SEC/PRIV enable on event input 78 */
#define EXTI1_SECCFGR3_SEC79_Pos  (15U)
#define EXTI1_SECCFGR3_SEC79_Msk  (0x1UL << EXTI1_SECCFGR3_SEC79_Pos)           /*!< 0x00008000 */
#define EXTI1_SECCFGR3_SEC79      EXTI1_SECCFGR3_SEC79_Msk                     /*!< SEC/PRIV enable on event input 79 */
#define EXTI1_SECCFGR3_SEC80_Pos  (16U)
#define EXTI1_SECCFGR3_SEC80_Msk  (0x1UL << EXTI1_SECCFGR3_SEC80_Pos)           /*!< 0x00010000 */
#define EXTI1_SECCFGR3_SEC80      EXTI1_SECCFGR3_SEC80_Msk                     /*!< SEC/PRIV enable on event input 80 */
#define EXTI1_SECCFGR3_SEC81_Pos  (17U)
#define EXTI1_SECCFGR3_SEC81_Msk  (0x1UL << EXTI1_SECCFGR3_SEC81_Pos)           /*!< 0x00020000 */
#define EXTI1_SECCFGR3_SEC81      EXTI1_SECCFGR3_SEC81_Msk                     /*!< SEC/PRIV enable on event input 81 */
#define EXTI1_SECCFGR3_SEC82_Pos  (18U)
#define EXTI1_SECCFGR3_SEC82_Msk  (0x1UL << EXTI1_SECCFGR3_SEC82_Pos)           /*!< 0x00040000 */
#define EXTI1_SECCFGR3_SEC82      EXTI1_SECCFGR3_SEC82_Msk                     /*!< SEC/PRIV enable on event input 82 */
#define EXTI1_SECCFGR3_SEC83_Pos  (19U)
#define EXTI1_SECCFGR3_SEC83_Msk  (0x1UL << EXTI1_SECCFGR3_SEC83_Pos)           /*!< 0x00080000 */
#define EXTI1_SECCFGR3_SEC83      EXTI1_SECCFGR3_SEC83_Msk                     /*!< SEC/PRIV enable on event input 83 */
#define EXTI1_SECCFGR3_SEC84_Pos  (20U)
#define EXTI1_SECCFGR3_SEC84_Msk  (0x1UL << EXTI1_SECCFGR3_SEC84_Pos)           /*!< 0x00200000 */
#define EXTI1_SECCFGR3_SEC84      EXTI1_SECCFGR3_SEC84_Msk                     /*!< SEC/PRIV enable on event input 84 */
/* no event input 84 - 95 */

