zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp251fxx_cm0.h
/*****************  Bit definition for HSEM_SC1IER register  ******************/
#define HSEM_SC1IER_SISE_Pos            (0U)
#define HSEM_SC1IER_SISE_Msk            (0xFFFFUL << HSEM_SC1IER_SISE_Pos)         /*!< 0x0000FFFF */
#define HSEM_SC1IER_SISE                HSEM_SC1IER_SISE_Msk                      /*!< Secure interrupt(n) semaphore x enable bit. (x = 0 to 15) */

/*****************  Bit definition for HSEM_SC1ICR register  ******************/
#define HSEM_SC1ICR_SISC_Pos            (0U)
#define HSEM_SC1ICR_SISC_Msk            (0xFFFFUL << HSEM_SC1ICR_SISC_Pos)         /*!< 0x0000FFFF */
#define HSEM_SC1ICR_SISC                HSEM_SC1ICR_SISC_Msk                      /*!< Secure interrupt(n) semaphore x clear bit. (x = 0 to 15) */

/*****************  Bit definition for HSEM_SC1ISR register  ******************/
#define HSEM_SC1ISR_SISF_Pos            (0U)
#define HSEM_SC1ISR_SISF_Msk            (0xFFFFUL << HSEM_SC1ISR_SISF_Pos)         /*!< 0x0000FFFF */
#define HSEM_SC1ISR_SISF                HSEM_SC1ISR_SISF_Msk                      /*!< Secure interrupt(n) semaphore x status bit before enable (mask). (x = 0 to 15) */

/*****************  Bit definition for HSEM_SC1MISR register  *****************/
#define HSEM_SC1MISR_SMISF_Pos          (0U)
#define HSEM_SC1MISR_SMISF_Msk          (0xFFFFUL << HSEM_SC1MISR_SMISF_Pos)       /*!< 0x0000FFFF */
#define HSEM_SC1MISR_SMISF              HSEM_SC1MISR_SMISF_Msk                    /*!< Secure masked interrupt(n) semaphore x status bit after enable (mask). (x = 0 to 15) */

/*****************  Bit definition for HSEM_SECCFGR register  *****************/
#define HSEM_SECCFGR_SEC_Pos            (0U)
#define HSEM_SECCFGR_SEC_Msk            (0xFFFFUL << HSEM_SECCFGR_SEC_Pos)         /*!< 0x0000FFFF */
#define HSEM_SECCFGR_SEC                HSEM_SECCFGR_SEC_Msk                      /*!< Semaphore x security attribute. (x = 0 to 15) */

/****************  Bit definition for HSEM_PRIVCFGR register  *****************/
#define HSEM_PRIVCFGR_PRIV_Pos          (0U)
#define HSEM_PRIVCFGR_PRIV_Msk          (0xFFFFUL << HSEM_PRIVCFGR_PRIV_Pos)       /*!< 0x0000FFFF */
#define HSEM_PRIVCFGR_PRIV              HSEM_PRIVCFGR_PRIV_Msk                    /*!< Semaphore x privilege attribute. (x = 0 to 15) */

/****************  Bit definition for HSEM_C1CIDCFGR register  ****************/
#define HSEM_C1CIDCFGR_CFEN_Pos         (0U)
#define HSEM_C1CIDCFGR_CFEN_Msk         (0x1UL << HSEM_C1CIDCFGR_CFEN_Pos)         /*!< 0x00000001 */
#define HSEM_C1CIDCFGR_CFEN             HSEM_C1CIDCFGR_CFEN_Msk                   /*!< CPUn CID filtering enabled for HSEM_(S)CnIER, HSEM_(S)CnICR, HSEM_(S)CnISR, and HSEM_(S)CnMISR registers and for white list filter usage in HSEM_GpCIDCFGR.SEM_WLIST_Cn */
#define HSEM_C1CIDCFGR_CID_Pos          (4U)
#define HSEM_C1CIDCFGR_CID_Msk          (0xFUL << HSEM_C1CIDCFGR_CID_Pos)          /*!< 0x000000F0 */
#define HSEM_C1CIDCFGR_CID              HSEM_C1CIDCFGR_CID_Msk                    /*!< CPUn CID domain identification */

/****************  Bit definition for HSEM_C2CIDCFGR register  ****************/
#define HSEM_C2CIDCFGR_CFEN_Pos         (0U)
#define HSEM_C2CIDCFGR_CFEN_Msk         (0x1UL << HSEM_C2CIDCFGR_CFEN_Pos)         /*!< 0x00000001 */
#define HSEM_C2CIDCFGR_CFEN             HSEM_C2CIDCFGR_CFEN_Msk                   /*!< CPUn CID filtering enabled for HSEM_(S)CnIER, HSEM_(S)CnICR, HSEM_(S)CnISR, and HSEM_(S)CnMISR registers and for white list filter usage in HSEM_GpCIDCFGR.SEM_WLIST_Cn */
#define HSEM_C2CIDCFGR_CID_Pos          (4U)
#define HSEM_C2CIDCFGR_CID_Msk          (0xFUL << HSEM_C2CIDCFGR_CID_Pos)          /*!< 0x000000F0 */
#define HSEM_C2CIDCFGR_CID              HSEM_C2CIDCFGR_CID_Msk                    /*!< CPUn CID domain identification */

/****************  Bit definition for HSEM_C3CIDCFGR register  ****************/
#define HSEM_C3CIDCFGR_CFEN_Pos         (0U)
#define HSEM_C3CIDCFGR_CFEN_Msk         (0x1UL << HSEM_C3CIDCFGR_CFEN_Pos)         /*!< 0x00000001 */
#define HSEM_C3CIDCFGR_CFEN             HSEM_C3CIDCFGR_CFEN_Msk                   /*!< CPUn CID filtering enabled for HSEM_(S)CnIER, HSEM_(S)CnICR, HSEM_(S)CnISR, and HSEM_(S)CnMISR registers and for white list filter usage in HSEM_GpCIDCFGR.SEM_WLIST_Cn */
#define HSEM_C3CIDCFGR_CID_Pos          (4U)
#define HSEM_C3CIDCFGR_CID_Msk          (0xFUL << HSEM_C3CIDCFGR_CID_Pos)          /*!< 0x000000F0 */
#define HSEM_C3CIDCFGR_CID              HSEM_C3CIDCFGR_CID_Msk                    /*!< CPUn CID domain identification */

/*******************  Bit definition for HSEM_CR register  ********************/
#define HSEM_CR_CFEN_Pos                (0U)
#define HSEM_CR_CFEN_Msk                (0x1UL << HSEM_CR_CFEN_Pos)                /*!< 0x00000001 */
#define HSEM_CR_CFEN                    HSEM_CR_CFEN_Msk                          /*!< Semaphore CID filtered. */
#define HSEM_CR_LOCKID_Pos              (8U)
#define HSEM_CR_LOCKID_Msk              (0xFUL << HSEM_CR_LOCKID_Pos)              /*!< 0x00000F00 */
#define HSEM_CR_LOCKID                  HSEM_CR_LOCKID_Msk                        /*!< LOCKID of semaphores to be cleared. */
#define HSEM_CR_SEC_Pos                 (12U)
#define HSEM_CR_SEC_Msk                 (0x1UL << HSEM_CR_SEC_Pos)                 /*!< 0x00001000 */
#define HSEM_CR_SEC                     HSEM_CR_SEC_Msk                           /*!< SEC value of semaphores to be cleared. */
#define HSEM_CR_PRIV_Pos                (13U)
#define HSEM_CR_PRIV_Msk                (0x1UL << HSEM_CR_PRIV_Pos)                /*!< 0x00002000 */
#define HSEM_CR_PRIV                    HSEM_CR_PRIV_Msk                          /*!< PRIV value of semaphores to be cleared. */
#define HSEM_CR_KEY_Pos                 (16U)
#define HSEM_CR_KEY_Msk                 (0xFFFFUL << HSEM_CR_KEY_Pos)              /*!< 0xFFFF0000 */
#define HSEM_CR_KEY                     HSEM_CR_KEY_Msk                           /*!< Semaphore clear Key. */

/****************  Bit redefinition for legacy compatibility ******************/
#define HSEM_CR_COREID_Pos              HSEM_CR_LOCKID_Pos
#define HSEM_CR_COREID_Msk              HSEM_CR_LOCKID_Msk
#define HSEM_CR_COREID                  HSEM_CR_LOCKID

/******************  Bit definition for HSEM_KEYR register  *******************/
#define HSEM_KEYR_KEY_Pos               (16U)
#define HSEM_KEYR_KEY_Msk               (0xFFFFUL << HSEM_KEYR_KEY_Pos)            /*!< 0xFFFF0000 */
#define HSEM_KEYR_KEY                   HSEM_KEYR_KEY_Msk                         /*!< Semaphore Clear Key. */

/****************  Bit definition for HSEM_G0CIDCFGR register  ****************/
#define HSEM_G0CIDCFGR_CFEN_Pos         (0U)
#define HSEM_G0CIDCFGR_CFEN_Msk         (0x1UL << HSEM_G0CIDCFGR_CFEN_Pos)         /*!< 0x00000001 */
#define HSEM_G0CIDCFGR_CFEN             HSEM_G0CIDCFGR_CFEN_Msk                   /*!< Semaphore group p global CID filtering enable. */
#define HSEM_G0CIDCFGR_SEM_WLIST_C_Pos  (16U)
#define HSEM_G0CIDCFGR_SEM_WLIST_C_Msk  (0x7UL << HSEM_G0CIDCFGR_SEM_WLIST_C_Pos)  /*!< 0x00070000 */
#define HSEM_G0CIDCFGR_SEM_WLIST_C      HSEM_G0CIDCFGR_SEM_WLIST_C_Msk            /*!< Semaphore group p CID filtering enable. */

