zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp251fxx_cm0.h
/****************  Bit definition for LPTIM_HWCFGR2 register  *****************/
#define LPTIM_HWCFGR2_CFG1_Pos       (0U)
#define LPTIM_HWCFGR2_CFG1_Msk       (0xFUL << LPTIM_HWCFGR2_CFG1_Pos)        /*!< 0x0000000F */
#define LPTIM_HWCFGR2_CFG1           LPTIM_HWCFGR2_CFG1_Msk                  /*!< peripheral hardware configuration 1 */
#define LPTIM_HWCFGR2_CFG2_Pos       (8U)
#define LPTIM_HWCFGR2_CFG2_Msk       (0xFFUL << LPTIM_HWCFGR2_CFG2_Pos)       /*!< 0x0000FF00 */
#define LPTIM_HWCFGR2_CFG2           LPTIM_HWCFGR2_CFG2_Msk                  /*!< peripheral hardware configuration 2 */
#define LPTIM_HWCFGR2_CFG3_Pos       (16U)
#define LPTIM_HWCFGR2_CFG3_Msk       (0x1UL << LPTIM_HWCFGR2_CFG3_Pos)        /*!< 0x00010000 */
#define LPTIM_HWCFGR2_CFG3           LPTIM_HWCFGR2_CFG3_Msk                  /*!< peripheral hardware configuration 3 */

/****************  Bit definition for LPTIM_HWCFGR1 register  *****************/
#define LPTIM_HWCFGR1_CFG1_Pos       (0U)
#define LPTIM_HWCFGR1_CFG1_Msk       (0xFFUL << LPTIM_HWCFGR1_CFG1_Pos)       /*!< 0x000000FF */
#define LPTIM_HWCFGR1_CFG1           LPTIM_HWCFGR1_CFG1_Msk                  /*!< peripheral hardware configuration 1 */
#define LPTIM_HWCFGR1_CFG2_Pos       (8U)
#define LPTIM_HWCFGR1_CFG2_Msk       (0xFFUL << LPTIM_HWCFGR1_CFG2_Pos)       /*!< 0x0000FF00 */
#define LPTIM_HWCFGR1_CFG2           LPTIM_HWCFGR1_CFG2_Msk                  /*!< peripheral hardware configuration 2 */
#define LPTIM_HWCFGR1_CFG3_Pos       (16U)
#define LPTIM_HWCFGR1_CFG3_Msk       (0xFUL << LPTIM_HWCFGR1_CFG3_Pos)        /*!< 0x000F0000 */
#define LPTIM_HWCFGR1_CFG3           LPTIM_HWCFGR1_CFG3_Msk                  /*!< peripheral hardware configuration 3 */
#define LPTIM_HWCFGR1_CFG4_Pos       (24U)
#define LPTIM_HWCFGR1_CFG4_Msk       (0xFFUL << LPTIM_HWCFGR1_CFG4_Pos)       /*!< 0xFF000000 */
#define LPTIM_HWCFGR1_CFG4           LPTIM_HWCFGR1_CFG4_Msk                  /*!< peripheral hardware configuration 4 */

/******************  Bit definition for LPTIM_VERR register  ******************/
#define LPTIM_VERR_MINREV_Pos        (0U)
#define LPTIM_VERR_MINREV_Msk        (0xFUL << LPTIM_VERR_MINREV_Pos)         /*!< 0x0000000F */
#define LPTIM_VERR_MINREV            LPTIM_VERR_MINREV_Msk                   /*!< Minor revision */
#define LPTIM_VERR_MAJREV_Pos        (4U)
#define LPTIM_VERR_MAJREV_Msk        (0xFUL << LPTIM_VERR_MAJREV_Pos)         /*!< 0x000000F0 */
#define LPTIM_VERR_MAJREV            LPTIM_VERR_MAJREV_Msk                   /*!< Major revision */

/******************  Bit definition for LPTIM_PIDR register  ******************/
#define LPTIM_PIDR_P_ID_Pos          (0U)
#define LPTIM_PIDR_P_ID_Msk          (0xFFFFFFFFUL << LPTIM_PIDR_P_ID_Pos)    /*!< 0xFFFFFFFF */
#define LPTIM_PIDR_P_ID              LPTIM_PIDR_P_ID_Msk                     /*!< Peripheral type identifier */

/******************  Bit definition for LPTIM_SIDR register  ******************/
#define LPTIM_SIDR_S_ID_Pos          (0U)
#define LPTIM_SIDR_S_ID_Msk          (0xFFFFFFFFUL << LPTIM_SIDR_S_ID_Pos)    /*!< 0xFFFFFFFF */
#define LPTIM_SIDR_S_ID              LPTIM_SIDR_S_ID_Msk                     /*!< Registers map size identifier */

/******************************************************************************/
/*                                                                            */
/*                                 MDF/ADF                                    */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for MDF/ADF_GCR register  ********************/
#define MDF_GCR_TRGO_Pos                    (0U)
#define MDF_GCR_TRGO_Msk                    (0x1UL << MDF_GCR_TRGO_Pos)             /*!< 0x00000001 */
#define MDF_GCR_TRGO                        MDF_GCR_TRGO_Msk                        /*!<Trigger output control */
#define MDF_GCR_ILVNB_Pos                   (4U)
#define MDF_GCR_ILVNB_Msk                   (0xFUL << MDF_GCR_ILVNB_Pos)            /*!< 0x000000F0 */
#define MDF_GCR_ILVNB                       MDF_GCR_ILVNB_Msk                       /*!< Interleaved Number */

/*******************  Bit definition for MDF/ADF_CKGCR register  ********************/
#define MDF_CKGCR_CKDEN_Pos                 (0U)
#define MDF_CKGCR_CKDEN_Msk                 (0x1UL << MDF_CKGCR_CKDEN_Pos)          /*!< 0x00000001 */
#define MDF_CKGCR_CKDEN                     MDF_CKGCR_CKDEN_Msk                     /*!<CKGEN diveders enable */
#define MDF_CKGCR_CCK0EN_Pos                (1U)
#define MDF_CKGCR_CCK0EN_Msk                (0x1UL << MDF_CKGCR_CCK0EN_Pos)         /*!< 0x00000002 */
#define MDF_CKGCR_CCK0EN                    MDF_CKGCR_CCK0EN_Msk                    /*!<CCK0 clock enable */
#define MDF_CKGCR_CCK1EN_Pos                (2U)
#define MDF_CKGCR_CCK1EN_Msk                (0x1UL << MDF_CKGCR_CCK1EN_Pos)         /*!< 0x00000004 */
#define MDF_CKGCR_CCK1EN                    MDF_CKGCR_CCK1EN_Msk                    /*!<CCK1 clock enable */
#define MDF_CKGCR_CKGMOD_Pos                (4U)
#define MDF_CKGCR_CKGMOD_Msk                (0x1UL << MDF_CKGCR_CKGMOD_Pos)         /*!< 0x00000010 */
#define MDF_CKGCR_CKGMOD                    MDF_CKGCR_CKGMOD_Msk                    /*!<Clock genartor mode */
#define MDF_CKGCR_CCK0DIR_Pos               (5U)
#define MDF_CKGCR_CCK0DIR_Msk               (0x1UL << MDF_CKGCR_CCK0DIR_Pos)        /*!< 0x00000020 */
#define MDF_CKGCR_CCK0DIR                   MDF_CKGCR_CCK0DIR_Msk                   /*!<CCK0 clock direction */
#define MDF_CKGCR_CCK1DIR_Pos               (6U)
#define MDF_CKGCR_CCK1DIR_Msk               (0x1UL << MDF_CKGCR_CCK1DIR_Pos)        /*!< 0x00000040 */
#define MDF_CKGCR_CCK1DIR                   MDF_CKGCR_CCK1DIR_Msk                   /*!<CCK1 clock direction */
#define MDF_CKGCR_TRGSENS_Pos               (8U)
#define MDF_CKGCR_TRGSENS_Msk               (0x1UL << MDF_CKGCR_TRGSENS_Pos)        /*!< 0x00000100 */
#define MDF_CKGCR_TRGSENS                   MDF_CKGCR_TRGSENS_Msk                   /*!<CKGEN trigger sensitivity selection */
#define MDF_CKGCR_TRGSRC_Pos                (12U)
#define MDF_CKGCR_TRGSRC_Msk                (0xFUL << MDF_CKGCR_TRGSRC_Pos)         /*!< 0x0000F000 */
#define MDF_CKGCR_TRGSRC                    MDF_CKGCR_TRGSRC_Msk                    /*!<Digital Filter trigger signal selection */
#define MDF_CKGCR_TRGSRC_0                  (0x1UL << MDF_CKGCR_TRGSRC_Pos)         /*!< 0x00001000 */
#define MDF_CKGCR_TRGSRC_1                  (0x2UL << MDF_CKGCR_TRGSRC_Pos)         /*!< 0x00002000 */
#define MDF_CKGCR_TRGSRC_2                  (0x4UL << MDF_CKGCR_TRGSRC_Pos)         /*!< 0x00004000 */
#define MDF_CKGCR_TRGSRC_3                  (0x8UL << MDF_CKGCR_TRGSRC_Pos)         /*!< 0x00008000 */
#define MDF_CKGCR_CCKDIV_Pos                (16U)
#define MDF_CKGCR_CCKDIV_Msk                (0xFUL << MDF_CKGCR_CCKDIV_Pos)         /*!< 0x000F0000 */
#define MDF_CKGCR_CCKDIV                    MDF_CKGCR_CCKDIV_Msk                    /*!<Divider to controle the MDF_CCK clock */
#define MDF_CKGCR_PROCDIV_Pos               (24U)
#define MDF_CKGCR_PROCDIV_Msk               (0x7FUL << MDF_CKGCR_PROCDIV_Pos)       /*!< 0x7F000000 */
#define MDF_CKGCR_PROCDIV                   MDF_CKGCR_PROCDIV_Msk                   /*!<Divider to controle the serial interface clock */
#define MDF_CKGCR_CCKACTIVE_Pos             (31U)
#define MDF_CKGCR_CCKACTIVE_Msk             (0x1UL << MDF_CKGCR_CCKACTIVE_Pos)      /*!< 0x80000000 */
#define MDF_CKGCR_CCKACTIVE                 MDF_CKGCR_CCKACTIVE_Msk                 /*!<Clock generator active flag */

/*******************  Bit definition for MDF/ADF_OR register  ********************/
#define MDF_OR_OPTION_Pos                   (0U)
#define MDF_OR_OPTION_Msk                   (0xFFFFFFFFUL << MDF_OR_OPTION_Pos)     /*!< 0xFFFFFFFF */
#define MDF_OR_OPTION                       MDF_OR_OPTION_Msk                       /*!<Option Controle Bits */

