zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp251fxx_cm0.h
#define RISC_PERCIDCFGR_SEMEN_Pos     (1U)
#define RISC_PERCIDCFGR_SEMEN_Msk     (0x1UL << RISC_PERCIDCFGR_SEMEN_Pos)       /*!< 0x00000002 */
#define RISC_PERCIDCFGR_SEMEN         RISC_PERCIDCFGR_SEMEN_Msk

#define RISC_PERCIDCFGR_SCID_Pos      (4U)
#define RISC_PERCIDCFGR_SCID_Msk      (0x7UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000070 */
#define RISC_PERCIDCFGR_SCID          RISC_PERCIDCFGR_SCID_Msk
#define RISC_PERCIDCFGR_SCID0         (0x0UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000000 */
#define RISC_PERCIDCFGR_SCID1         (0x1UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000010 */
#define RISC_PERCIDCFGR_SCID2         (0x2UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000020 */
#define RISC_PERCIDCFGR_SCID3         (0x3UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000030 */
#define RISC_PERCIDCFGR_SCID4         (0x4UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000040 */
#define RISC_PERCIDCFGR_SCID5         (0x5UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000050 */
#define RISC_PERCIDCFGR_SCID6         (0x6UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000060 */
#define RISC_PERCIDCFGR_SCID7         (0x7UL << RISC_PERCIDCFGR_SCID_Pos)        /*!< 0x00000070 */

#define RISC_PERCIDCFGR_SEMWL_Pos     (16U)
#define RISC_PERCIDCFGR_SEMWL_Msk     (0xFFUL << RISC_PERCIDCFGR_SEMWL_Pos)      /*!< 0x00FF0000 */
#define RISC_PERCIDCFGR_SEMWL         RISC_PERCIDCFGR_SEMWL_Msk
#define RISC_PERCIDCFGR_SEMWLC0       (0x1UL << RISC_PERCIDCFGR_SEMWL_Pos)       /*!< 0x00010000 */
#define RISC_PERCIDCFGR_SEMWLC1       (0x2UL << RISC_PERCIDCFGR_SEMWL_Pos)       /*!< 0x00020000 */
#define RISC_PERCIDCFGR_SEMWLC2       (0x4UL << RISC_PERCIDCFGR_SEMWL_Pos)       /*!< 0x00040000 */
#define RISC_PERCIDCFGR_SEMWLC3       (0x8UL << RISC_PERCIDCFGR_SEMWL_Pos)       /*!< 0x00080000 */
#define RISC_PERCIDCFGR_SEMWLC4       (0x10UL << RISC_PERCIDCFGR_SEMWL_Pos)      /*!< 0x00100000 */
#define RISC_PERCIDCFGR_SEMWLC5       (0x20UL << RISC_PERCIDCFGR_SEMWL_Pos)      /*!< 0x00200000 */
#define RISC_PERCIDCFGR_SEMWLC6       (0x40UL << RISC_PERCIDCFGR_SEMWL_Pos)      /*!< 0x00400000 */
#define RISC_PERCIDCFGR_SEMWLC7       (0x80UL << RISC_PERCIDCFGR_SEMWL_Pos)      /*!< 0x00800000 */

/*******************  Bits definition for RISC_PERx_SEMCR register ************/
#define RISC_PERSEMCR_SEMMUTEX_Pos    (0U)
#define RISC_PERSEMCR_SEMMUTEX_Msk    (0x1UL << RISC_PERSEMCR_SEMMUTEX_Pos)      /*!< 0x00000001 */
#define RISC_PERSEMCR_SEMMUTEX        RISC_PERSEMCR_SEMMUTEX_Msk

#define RISC_PERSEMCR_SEMCID_Pos      (4U)
#define RISC_PERSEMCR_SEMCID_Msk      (0x7UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000070 */
#define RISC_PERSEMCR_SEMCID          RISC_PERSEMCR_SEMCID_Msk
#define RISC_PERSEMCR_SEMCID0         (0x0UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000000 */
#define RISC_PERSEMCR_SEMCID1         (0x1UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000010 */
#define RISC_PERSEMCR_SEMCID2         (0x2UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000020 */
#define RISC_PERSEMCR_SEMCID3         (0x3UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000030 */
#define RISC_PERSEMCR_SEMCID4         (0x4UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000040 */
#define RISC_PERSEMCR_SEMCID5         (0x5UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000050 */
#define RISC_PERSEMCR_SEMCID6         (0x6UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000060 */
#define RISC_PERSEMCR_SEMCID7         (0x7UL << RISC_PERSEMCR_SEMCID_Pos)        /*!< 0x00000070 */

/*******************  Bits definition for RISC_REGx_zCFGR register ************/
#define RISC_REGCFGR_SREN_Pos         (0U)
#define RISC_REGCFGR_SREN_Msk         (0x1UL << RISC_REGCFGR_SREN_Pos)           /*!< 0x00000001 */
#define RISC_REGCFGR_SREN             RISC_REGCFGR_SREN_Msk

#define RISC_REGCFGR_RLOCK_Pos        (1U)
#define RISC_REGCFGR_RLOCK_Msk        (0x1UL << RISC_REGCFGR_RLOCK_Pos)          /*!< 0x00000002 */
#define RISC_REGCFGR_RLOCK            RISC_REGCFGR_RLOCK_Msk

#define RISC_REGCFGR_SRCID_Pos        (4U)
#define RISC_REGCFGR_SRCID_Msk        (0x7UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000070 */
#define RISC_REGCFGR_SRCID            RISC_REGCFGR_SRCID_Msk
#define RISC_REGCFGR_SRCID0           (0x0UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000000 */
#define RISC_REGCFGR_SRCID1           (0x1UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000010 */
#define RISC_REGCFGR_SRCID2           (0x2UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000020 */
#define RISC_REGCFGR_SRCID3           (0x3UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000030 */
#define RISC_REGCFGR_SRCID4           (0x4UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000040 */
#define RISC_REGCFGR_SRCID5           (0x5UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000050 */
#define RISC_REGCFGR_SRCID6           (0x6UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000060 */
#define RISC_REGCFGR_SRCID7           (0x7UL << RISC_REGCFGR_SRCID_Pos)          /*!< 0x00000070 */

#define RISC_REGCFGR_SEC_Pos          (8U)
#define RISC_REGCFGR_SEC_Msk          (0x1UL << RISC_REGCFGR_SEC_Pos)            /*!< 0x00000100 */
#define RISC_REGCFGR_SEC              RISC_REGCFGR_SEC_Msk

#define RISC_REGCFGR_PRIV_Pos         (9U)
#define RISC_REGCFGR_PRIV_Msk         (0x1UL << RISC_REGCFGR_PRIV_Pos)           /*!< 0x00000200 */
#define RISC_REGCFGR_PRIV             RISC_REGCFGR_PRIV_Msk


/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RTC_TR register  *******************/
#define RTC_TR_SU_Pos                (0U)
#define RTC_TR_SU_Msk                (0xFUL << RTC_TR_SU_Pos)                            /*!< 0x0000000F */
#define RTC_TR_SU                    RTC_TR_SU_Msk
#define RTC_TR_SU_0                  (0x1UL << RTC_TR_SU_Pos)                            /*!< 0x00000001 */
#define RTC_TR_SU_1                  (0x2UL << RTC_TR_SU_Pos)                            /*!< 0x00000002 */
#define RTC_TR_SU_2                  (0x4UL << RTC_TR_SU_Pos)                            /*!< 0x00000004 */
#define RTC_TR_SU_3                  (0x8UL << RTC_TR_SU_Pos)                            /*!< 0x00000008 */
#define RTC_TR_ST_Pos                (4U)
#define RTC_TR_ST_Msk                (0x7UL << RTC_TR_ST_Pos)                            /*!< 0x00000070 */
#define RTC_TR_ST                    RTC_TR_ST_Msk
#define RTC_TR_ST_0                  (0x1UL << RTC_TR_ST_Pos)                            /*!< 0x00000010 */
#define RTC_TR_ST_1                  (0x2UL << RTC_TR_ST_Pos)                            /*!< 0x00000020 */
#define RTC_TR_ST_2                  (0x4UL << RTC_TR_ST_Pos)                            /*!< 0x00000040 */
#define RTC_TR_MNU_Pos               (8U)
#define RTC_TR_MNU_Msk               (0xFUL << RTC_TR_MNU_Pos)                           /*!< 0x00000F00 */
#define RTC_TR_MNU                   RTC_TR_MNU_Msk
#define RTC_TR_MNU_0                 (0x1UL << RTC_TR_MNU_Pos)                           /*!< 0x00000100 */
#define RTC_TR_MNU_1                 (0x2UL << RTC_TR_MNU_Pos)                           /*!< 0x00000200 */
#define RTC_TR_MNU_2                 (0x4UL << RTC_TR_MNU_Pos)                           /*!< 0x00000400 */
#define RTC_TR_MNU_3                 (0x8UL << RTC_TR_MNU_Pos)                           /*!< 0x00000800 */
#define RTC_TR_MNT_Pos               (12U)
#define RTC_TR_MNT_Msk               (0x7UL << RTC_TR_MNT_Pos)                           /*!< 0x00007000 */
#define RTC_TR_MNT                   RTC_TR_MNT_Msk
#define RTC_TR_MNT_0                 (0x1UL << RTC_TR_MNT_Pos)                           /*!< 0x00001000 */
#define RTC_TR_MNT_1                 (0x2UL << RTC_TR_MNT_Pos)                           /*!< 0x00002000 */
#define RTC_TR_MNT_2                 (0x4UL << RTC_TR_MNT_Pos)                           /*!< 0x00004000 */
#define RTC_TR_HU_Pos                (16U)
#define RTC_TR_HU_Msk                (0xFUL << RTC_TR_HU_Pos)                            /*!< 0x000F0000 */
#define RTC_TR_HU                    RTC_TR_HU_Msk
#define RTC_TR_HU_0                  (0x1UL << RTC_TR_HU_Pos)                            /*!< 0x00010000 */
#define RTC_TR_HU_1                  (0x2UL << RTC_TR_HU_Pos)                            /*!< 0x00020000 */
#define RTC_TR_HU_2                  (0x4UL << RTC_TR_HU_Pos)                            /*!< 0x00040000 */
#define RTC_TR_HU_3                  (0x8UL << RTC_TR_HU_Pos)                            /*!< 0x00080000 */
#define RTC_TR_HT_Pos                (20U)
#define RTC_TR_HT_Msk                (0x3UL << RTC_TR_HT_Pos)                            /*!< 0x00300000 */
#define RTC_TR_HT                    RTC_TR_HT_Msk
#define RTC_TR_HT_0                  (0x1UL << RTC_TR_HT_Pos)                            /*!< 0x00100000 */
#define RTC_TR_HT_1                  (0x2UL << RTC_TR_HT_Pos)                            /*!< 0x00200000 */
#define RTC_TR_PM_Pos                (22U)
#define RTC_TR_PM_Msk                (0x1UL << RTC_TR_PM_Pos)                            /*!< 0x00400000 */
#define RTC_TR_PM                    RTC_TR_PM_Msk

